Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: An alternative way to adjust the volume is to have the script send volume-control keystrokes to change the master volume for the entire system, such as in the example below:
ja: ボリュームを調整する別の方法として、スクリプトにボリュームコントロールのキーストロークを送信させ、以下の例のようにシステム全体のマスターボリュームを変更する方法があります：

source: An alternative way to create a shortcut to a URL is the following example, which creates a special URL shortcut.
ja: 別の方法として、特別なURLのショートカットを作成する次の例もあります。

source: An alternative way to toggle the master mute setting of the default playback device is to have the script send a keystroke, such as in the example below:
ja: デフォルトの再生デバイスのマスターミュート設定を切り替える別の方法は、以下の例のように、スクリプトにキーストロークを送信させることです：

source: An ampersand (&) may be used in the text to underline one of its letters.
ja: 本文中でアンパサンド（&）を使用し、1文字に下線を引くことができる。

source: An ampersand may be used between any two keys or mouse buttons to combine them into a custom hotkey.
ja: アンパサンドは、任意の2つのキーまたはマウスボタンの間に使用し、カスタムホットキーに結合することができます。

source: An appropriate version of AutoHotkey32.exe or AutoHotkey64.exe can be used instead of AutoHotkeyUX.exe (which is just a copy).
ja: AutoHotkeyUX.exe（単なるコピーです）の代わりに、AutoHotkey32.exeまたはAutoHotkey64.exeの適切なバージョンを使用できます。

source: An area where free-form text can be typed by the user.
ja: ユーザーが自由にテキストを入力できる領域。

source: An argument was passed a value of an unexpected type.
ja: 引数に予期せぬ型の値が渡された。

source: An array can also be extended by assigning a larger value to Length.
ja: また、Lengthに大きな値を代入することで、配列を拡張することができる。

source: An array can be resized by inserting or removing elements with the appropriate method, or by assigning Length.
ja: 配列のサイズは、適切な方法で要素を挿入または削除するか、Lengthを代入することで変更することができます。

source: An array of filenames, where FileArray[1] is the first file and FileArray.Length returns the number of files.
ja: ファイル名の配列。FileArray[1]は最初のファイル、FileArray.Lengthはファイル数を返す。

source: An array of strings (e.g. ["Red","Green","Blue"]) to be inserted at the end of the control's list.
ja: コントロールのリストの最後に挿入する文字列の配列（例：["Red", "Green", "Blue"]）。

source: An assignment can also target a property of an object, such as myArray.Length += n or myArray[i] .= t.
ja: 代入は、myArray.Length += nや myArray[i] .= tのように、オブジェクトのプロパティを対象とすることもできる。

source: An associative array can be created as follows:
ja: 連想配列は次のようにして作ることができる：

source: An asterisk matches zero or more of the preceding character, class, or subpattern.
ja: アスタリスクは、直前の文字、クラス、サブパターンの0個以上にマッチする。

source: An asterisk should not be used for string types such as LPTSTR, pointers to structures such as LPRECT, or arrays; for these, "Str" or "Ptr" should be used, depending on whether you pass a string, address or Buffer.
ja: LPTSTRのような文字列型、LPRECTのような構造体へのポインタ、配列にはアスタリスクを使うべきではありません。これらには、文字列、アドレス、Bufferのどれを渡すかによって、"Str"または"Ptr"を使うべきです。

source: An attempt was made to read the value of a variable, property or item, but there was no value.
ja: 変数、プロパティ、アイテムの値を読み取ろうとしたが、値がありませんでした。

source: An audio driver has a fixed name, but endpoint names may be changed by an administrator at any time via the Sound control panel.
ja: オーディオドライバの名前は固定されていますが、エンドポイント名は管理者がサウンドコントロールパネルからいつでも変更することができます。

source: An easy way to retrieve the unique ID of the active window is with ActiveHwnd := WinExist("A").
ja: アクティブウィンドウのユニークIDを取得する簡単な方法は、ActiveHwnd := WinExist("A")です。。

source: An embedded script can be specified on the command line or with #Include by writing an asterisk (*) followed by the resource name.
ja: 埋め込みスクリプトは、アスタリスク（*）の後にリソース名を書くことで、コマンドラインまたは#Includeで指定できます。

source: An empty menu still exists and thus any other menus that use it as a submenu will retain those submenus.
ja: 空のメニューはまだ存在するので、それをサブメニューとして使用している他のメニューは、それらのサブメニューを保持します。

source: An empty string is also returned if the system refused to show the dialog, but this is very rare.
ja: また、システムがダイアログの表示を拒否した場合は空文字列が返されますが、これは非常にまれなことです。

source: An empty string is returned if either parameter is invalid or if the requested type information could not be retrieved.
ja: いずれかのパラメータが無効な場合、または要求された型情報を取得できなかった場合は、空文字列が返されます。

source: An ending character (e.g. Space, ., or Enter) is not required to trigger the hotstring.
ja: ホットストリングのトリガーには、Space、.、Enterなどのエンディングキャラクターは必要ありません。

source: An enumerator is a type of function object which is called repeatedly to enumerate a sequence of values.
ja: Enumeratorオブジェクトは、一連の値を列挙するために繰り返し呼び出される関数オブジェクトの一種です。

source: An environment variable created or changed with this function will be accessible only to programs the script launches via Run or RunWait.
ja: この機能で作成・変更された環境変数は、スクリプトがRunまたはRunWaitで起動したプログラムのみがアクセスできるようになります。

source: An error dialog will be displayed if the label does not exist.
ja: ラベルが存在しない場合は、エラーダイアログが表示されます。

source: An error is thrown if the property is not defined in a superclass or cannot be invoked.
ja: そのプロパティがスーパークラスで定義されていないか、呼び出すことができない場合はエラーがスローされる。

source: An example of a fatal exception is dereferencing an invalid pointer such as NULL (0).
ja: 致命的な例外の例としては、NULL（0）のような無効なポインタを再参照することが挙げられます。

source: An example of a runtime error is Run/RunWait being unable to launch the specified program or document.
ja: ランタイムエラーの例として、Run/RunWaitが指定されたプログラムやドキュメントを起動できないことが挙げられます。

source: An example showing what shouldn't be done to a hotkey:
ja: ホットキーにやってはいけないことを示す例：

source: An example would be accessing the version number of the script, which may be changed often.
ja: 例えば、頻繁に変更される可能性のあるスクリプトのバージョン番号にアクセスするような場合である。

source: An exception is thrown if Obj is of an incorrect type.
ja: Objが不正な型である場合は例外が発生します。

source: An exception is thrown if Obj or BaseObj is of an incorrect type.
ja: ObjまたはBaseObjが不正な型である場合、例外が発生します。

source: An exception is thrown if obj is not an object or there is a problem retrieving or calling its enumerator.
ja: objがオブジェクトでない場合、またはその列挙体の取得や呼び出しに問題がある場合は、例外が発生します。

source: An exception is thrown if Bytes exceeds the size of the buffer.
ja: Bytesがバッファのサイズを超える場合は例外が発生します。

source: An exception is thrown if Value is a ComObject.
ja: Valueが ComObjectの場合は例外がスローされる。

source: An exception is thrown if HotIf's parameter is invalid, such as if it does not match an existing expression and is not a valid callback function.
ja: HotIfのパラメータが既存の式と一致しない、有効なコールバック関数でないなど、無効な場合は例外が発生します。

source: An exception is thrown if a parameter is invalid or memory allocation fails.
ja: パラメータが無効な場合、またはメモリ確保に失敗した場合は例外がスローされます。

source: An exception is thrown if an error occurs.
ja: エラーが発生した場合は、例外がスローされます。

source: An exception is thrown if conversion fails.
ja: 変換に失敗した場合は、例外が発生します。

source: An exception is thrown if one attempts to retrieve the value of an element which does not exist, unless the map has a Default property defined.
ja: マップにDefaultプロパティが定義されていない限り、存在しない要素の値を取得しようとすると例外がスローされます。

source: An exception is thrown if the window has already been constructed or destroyed.
ja: ウィンドウが既に構築または破棄されている場合は、例外が発生します。

source: An exception is thrown if there are too few or too many parameters, or if a read-only property is assigned a value.
ja: パラメータが少なすぎたり多すぎたりした場合や、読み取り専用のプロパティに値が割り当てられた場合は、例外が発生します。

source: An exception is thrown in any of the following cases:
ja: 例外は以下のいずれかの場合にスローされる：

source: An exception is thrown in the following cases:
ja: 以下の場合は例外が発生します：

source: An exception is thrown on failure instead of setting ErrorLevel.
ja: ErrorLevelを設定する代わりに、失敗時に例外がスローされます。

source: An exception is thrown on failure, if detected.
ja: 検出された場合、失敗時に例外がスローされます。

source: An exception is thrown on failure, or if the window or control could not be found.
ja: 失敗したときやウィンドウやコントロールが見つからなかったときは、例外がスローされます。

source: An exception is thrown on failure, such as if Drive does not exist or does not support the locking feature.
ja: ドライブ が存在しないかロック機能をサポートしていない場合など、失敗すると例外がスローされます。

source: An exception is thrown on failure, such as if a parameter is invalid or the object does not support the interface specified by IID.
ja: パラメータが無効であったり、オブジェクトがIIDで指定されたインタフェースをサポートしていない場合など、失敗した場合は例外がスローされます。

source: An exception is thrown on failure, such as if the drive does not contain formatted media.
ja: ドライブにフォーマットされたメディアが含まれていない場合など、失敗したときは例外がスローされます。

source: An exception is thrown on failure, such as if the interface is not supported.
ja: インターフェースがサポートされていない場合など、失敗した場合は例外が発生します。

source: An exception is thrown on failure, such as if the specified drive does not exist or does not support the locking feature.
ja: 指定されたドライブが存在しない場合やロック機能をサポートしていない場合など、失敗した場合は例外がスローされます。

source: An exception is thrown on failure.
ja: 失敗した場合は例外がスローされます。

source: An exception is thrown under any of the following conditions:
ja: 例外は、以下のいずれかの条件でスローされる：

source: An exception is thrown when any of the following failures occur (instead of ignoring the failure or producing an empty string):
ja: 以下のいずれかの失敗が発生した場合、例外が発生します（失敗を無視したり、空文字列を生成するのではありません）：

source: An exception is thrown when the for-loop attempts to call the method if there are more variables than parameters (too many parameters passed, too few defined) or fewer variables than mandatory parameters.
ja: forループでメソッドを呼び出そうとしたとき、パラメータより変数の方が多い場合（渡されたパラメータが多すぎ、定義されたパラメータが少なすぎる）、または必須パラメータより変数の方が少ない場合は、例外が発生します。

source: An exception may be thrown if the source address is invalid.
ja: 送信元アドレスが無効な場合、例外が発生することがあります。

source: An exception may be thrown if the target address is invalid.
ja: ターゲットアドレスが無効な場合、例外が発生することがあります。

source: An exempt hotkey/hotstring will remain enabled even while suspension is ON.
ja: 免除されたホットキー/ホットストリングは、サスペンドがオンになっていても有効なままです。

source: An explicit key code such as {vkFF} or {sc001} may also be specified.
ja: {vkFF} や {sc001}のような明示的なキーコードを指定することも可能です。

source: An explicit virtual key code such as vkFF may also be specified.
ja: また、vkFFのような明示的な仮想鍵コードを指定することもできる。

source: An expression statement is an expression used on its own, typically for its side-effects.
ja: 式の文は、それ自体で使用される式で、通常はその副作用のために使用されます。

source: An immediate error message may seem a bit confrontational, but is generally more helpful.
ja: すぐにエラーメッセージが表示されるのは、少し対立的に見えるかもしれませんが、一般的にはより有用です。

source: An indirect reference to the variable.
ja: 変数への間接的な参照。

source: An inherited value property is equivalent to a set of accessor functions which return or call the value, or store a new value in this.
ja: 継承された値プロパティは、値を返すか呼び出すか、あるいはthisに新しい値を格納するアクセッサ関数のセットと同等です。

source: An input box usually looks like this:
ja: インプットボックスは通常このような形をしています：

source: An integer between -2147483648 and 2147483647 that is returned to its caller when the script exits.
ja: スクリプト終了時に呼び出し元に返される -2147483648 から 2147483647 までの整数値。

source: An integer between 0 and 100.
ja: 0～100の整数値です。

source: An integer indicating the type of value.
ja: 値の種類を示す整数。

source: An interface identifier (GUID) in the form "{xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx}".
ja: インターフェース識別子（GUID）。「{xxxxxxx-xxxx-xxxx-xxxx-xxxx}」の形式をとる。

source: An interface pointer can be wrapped immediately upon being returned to the script (typically from ComCall or DllCall), avoiding the need to explicitly release it at some later point.
ja: インターフェイスポインターは、スクリプトに返されるとすぐにラップされるため（通常はComCallまたはDllCallから）、後の時点で明示的にリリースする必要がありません。

source: An internal function call to a Win32 function failed.
ja: Win32関数への内部関数呼び出しに失敗しました。

source: An interval greater than 16 may be needed for reliability.
ja: 信頼性のために16以上の間隔が必要な場合があります。

source: An item is checked or unchecked.
ja: 項目がチェックされているか、チェックされていないかの状態です。

source: An item is expanded or collapsed.
ja: アイテムが展開または折りたたまれている。

source: An item is selected or deselected.
ja: 項目が選択または非選択になる。

source: An item is selected.
ja: アイテムが選択されている。

source: An item's label can only be edited if -ReadOnly has been used in the control's options.
ja: 項目のラベルは、コントロールのオプションで-ReadOnlyが使用されている場合のみ編集可能です。

source: An item's label is edited by the user.
ja: アイテムのラベルは、ユーザーが編集します。

source: An object can be composed of any number of properties (which can be retrieved or set) and methods (which can be called).
ja: オブジェクトは、任意の数のプロパティ（取得または設定可能）と メソッド(呼び出し可能）で構成されます。

source: An object can have properties and items (such as array elements).
ja: オブジェクトはプロパティと アイテム（配列要素など）を持つことができる。

source: An object cannot be implicitly converted to a string or number.
ja: オブジェクトを暗黙のうちに文字列や数値に変換することはできません。

source: An object compares equal to another value only if it is the same object.
ja: オブジェクトは、それが同じオブジェクトである場合にのみ、別の値と等しく比較されます。

source: An object is basically a collection of variables.
ja: オブジェクトは基本的に変数の集まりである。

source: An object is deleted only after all references have been released; you cannot delete an object explicitly, and should not try.
ja: オブジェクトは、すべての参照が解放された後にのみ削除されます。オブジェクトを明示的に削除することはできませんので、試さないでください。

source: An object literal can be used within an expression to create an improvised object.
ja: オブジェクト・リテラルを式の中で使うと、即席のオブジェクトを作ることができる。

source: An object literal cannot legally follow ) or ], so if the brace follows either of those symbols (excluding whitespace), it is interpreted as the beginning of a block (such as for a function or property definition).
ja: オブジェクト・リテラルは法律上、)または]に続くことはできないので、中括弧がこれらの記号のどちらかに続く場合（空白を除く）、（関数やプロパティ定義のような）ブロックの開始として解釈される。

source: An object literal consists of a pair of braces ({}) enclosing a list of comma-delimited name-value pairs.
ja: オブジェクト・リテラルは、カンマで区切られた名前と値のペアのリストを中括弧（{}）で囲んだものである。

source: An object may also have a default property, which is invoked when square brackets are used without a property name.
ja: オブジェクトは、デフォルトプロパティを持つことができます。これは、プロパティ名なしで角括弧が使用されたときに呼び出されます。

source: An object may also support indexing:
ja: オブジェクトはインデックスをサポートすることもある：

source: An object may also support indexing: MyArray[Index] actually invokes the __Item property of MyArray, passing Index as a parameter.
ja: オブジェクトはインデックスをサポートすることもある：MyArray[Index]は、実際にはMyArrayの__Itemプロパティを呼び出し、Indexをパラメータとして渡す。

source: An object might also contain items, such as array elements.
ja: オブジェクトには、配列要素などのアイテムが含まれることもある。

source: An object of any type with a Hwnd property, such as a GuiControl.
ja: GuiControlなど、Hwndプロパティを持つ任意の型のオブジェクト。

source: An object which raises events.
ja: イベントを発生させるオブジェクトです。

source: An object with one of the following own properties, or both Get and Set:
ja: 以下のいずれかの自プロパティを持つオブジェクト、またはGetとSetの両方を持つオブジェクト：

source: An object's address can be retrieved via address := ObjPtr(myObject); however, this effectively makes two references to the object, but the program only knows about the one in myObject.
ja: オブジェクトのアドレスは、address := ObjPtr(myObject)で取得することができる。しかし、これは事実上オブジェクトへの参照を2つ作ることになり、プログラムはmyObjectの中の1つしか知らない。

source: An object's base is also used to identify its type or class.
ja: オブジェクトのベースは、そのタイプやクラスを識別するためにも使われる。

source: An object's native type is decided by the nearest prototype object belonging to a built-in class, such as Object.Prototype or Array.Prototype.
ja: オブジェクトのネイティブタイプは、Object.Prototypeや Array.Prototypeなどの組み込みクラスに属する、最も近いプロトタイプオブジェクトによって決定されます。

source: An object-assignment fails due to memory allocation failure.
ja: メモリ割り当ての失敗により、オブジェクト割り当てに失敗しました。

source: An offset - in bytes - which is added to Source to determine the source address.
ja: 送信元アドレスを決定するためにSourceに追加されるオフセット（バイト単位）です。

source: An offset - in bytes - which is added to Target to determine the target address.
ja: ターゲットアドレスを決定するためにTargetに追加されるオフセット（バイト単位）です。

source: An optical or coaxial digital output.
ja: 光または同軸デジタル出力。

source: An optional letter "v" followed by a version number.
ja: オプションの文字「v」の後にバージョン番号が続く。

source: An optional list of characters (case sensitive) to exclude from the beginning and end of each substring.
ja: それぞれの部分文字列の先頭と末尾から除外する文字（大文字と小文字を区別する）のリスト（オプション）です。

source: An optional list of characters (case-sensitive) to exclude from the beginning and/or end of String.
ja: Stringの先頭や末尾から除外する文字（大文字と小文字を区別する）のリスト（オプション）。

source: An optional plus sign can be included to position a control relative to the right or bottom edge (respectively) of the control that was previously added.
ja: オプションのプラス記号は、先に追加されたコントロールの右端または下端（それぞれ）に対して相対的にコントロールを配置するために含めることができます。

source: An optional string to write.
ja: 書き込む文字列（オプション）。

source: An overlapped window has a title bar and a border.
ja: オーバーラップしたウィンドウにはタイトルバーとボーダーがある。

source: An own value property of the object or one of its base objects, where the value is a function object.
ja: オブジェクトまたはそのベースとなるオブジェクトの1つの独自の値プロパティで、値が関数オブジェクトである場合。

source: An owned window has no taskbar button by default, and when visible it is always on top of its owner.
ja: 所有するウィンドウは、デフォルトではタスクバーボタンがなく、表示されているときは常に所有者の上に表示されます。

source: An unexpected type of value was used as input for a function, property assignment, or some other operation.
ja: 関数、プロパティの割り当て、またはその他の操作の入力として、予期しないタイプの値が使用されました。

source: An unexpected value was used as input for a function, property assignment, or some other operation.
ja: 予期せぬ値が、関数やプロパティの割り当て、その他の操作の入力として使用されました。

source: An unmanaged object pointer or COM interface pointer.
ja: アンマネージドオブジェクトポインタまたはCOMインターフェイスポインタです。

source: An unset expression has one of the following effects:
ja: アンセット式は、以下のいずれかの効果を持ちます：

source: An unset parameter automatically receives its default value (if any) before the function executes.
ja: 未設定のパラメータは、関数が実行される前に自動的にそのデフォルト値（もしあれば）を受け取ります。

source: And for compiled scripts, the format is:
ja: また、コンパイルされたスクリプトの場合、フォーマットは次のようになる：

source: And the content needs to go below, enclosed in curly brackets.
ja: そして、その内容は中カッコで囲んで下に書く必要があります。

source: And to everyone else who's contributed or sent in bug reports or suggestions:
ja: そして、バグレポートや提案を寄せてくれた皆さん：

source: And to everyone else who's contributed or sent in bug reports or suggestions: Thanks!
ja: そして、バグレポートや提案を寄せてくれた皆さん：ありがとう！

source: And while you wait for help, you can try learning and doing it yourself.
ja: そして助けを待つ間、自分で学んでやってみることもできる。

source: And you must show them these terms so they know their rights.
ja: そして、彼らが自分たちの権利を知ることができるよう、これらの条件を示さなければならない。

source: Another advantage of the method above is that unlike MouseClickDrag, it automatically compensates when the user has swapped the left and right mouse buttons via the system's control panel.
ja: 上記の方法のもう一つの利点は、MouseClickDragとは異なり、ユーザーがシステムのコントロールパネルでマウスの左右のボタンを入れ替えた場合に自動的に補正されることです。

source: Another advantage to PostMessage is that the Window can be in the background; by contrast, sending mouse clicks would require it to be active.
ja: PostMessageのもう一つの利点は、ウィンドウをバックグラウンドにできることである。対照的に、マウスクリックを送信するには、ウィンドウをアクティブにする必要がある。

source: Another benefit is that like SendPlay below, SendInput postpones anything you type during a hotstring's auto-replacement text.
ja: もう一つの利点は、以下のSendPlayと同様に、SendInputはホットストリングの自動置換テキスト中に入力したものを延期することです。

source: Another common issue is that people think that everything needs to be wrapped in brackets with the Send function.
ja: もうひとつのよくある問題は、人々はすべてを括弧でくくる必要があると思っていることだ。

source: Another example is Join`r`n, which inserts CR+LF between lines.
ja: 他の例としては、行と行の間にCR+LFを挿入するJoin`r`nがある。

source: Another example is, if BlockInput "On" and BlockInput "MouseMove" are both in effect, mouse movement will be blocked until both are turned off.
ja: 他の例として、BlockInput "On"とBlockInput "MouseMove"の両方が有効な場合、両方がオフになるまでマウスの移動がブロックされることがあります。

source: Another method is to use Format to perform substitution.
ja: Format関数で置換することもできます。

source: Another option worth trying is ControlSend.
ja: また、ControlSendも試してみる価値のあるオプションです。

source: Another possible workaround is to apply the following registry setting on the local/client computer:
ja: もう1つの可能な回避策は、ローカル/クライアントコンピュータで以下のレジストリ設定を適用することです：

source: Another strategy is to explicitly apply rounding before comparison, such as by converting to a string.
ja: また、文字列に変換するなどして、比較の前に丸めを明示的に適用する方法もある。

source: Another way to write it is to return early (in other words, abort) if the wait times out.
ja: 別の書き方としては、待ち時間がタイムアウトしたら早めにリターンします（言い換えれば、アボートします）。

source: Antivirus
ja: アンチウイルス

source: Antivirus False Positives
ja: アンチウイルスの誤検知について

source: Any - Methods & Properties | AutoHotkey v2
ja: Any - メソッドとプロパティ｜AutoHotkey v2

source: Any OnExit functions registered by the script are called before the script terminates.
ja: スクリプトが登録したOnExit関数は、スクリプトが終了する前に呼び出されます。

source: Any OnMessage function that monitors a message which is not buffered.
ja: バッファリングされていないメッセージを監視するOnMessage関数。

source: Any callable object can be used as a meta-function by assigning it to the relevant property.
ja: 呼び出し可能なオブジェクトは、関連するプロパティに代入することで、メタファンクションとして使用することができる。

source: Any callback indirectly triggered by the thread itself (e.g. via SendMessage or DllCall).
ja: スレッド自身によって間接的にトリガーされるコールバック（SendMessageや DllCallなど）。

source: Any assignment operator can be used, but a compound assignment such as global HitCount += 1 would require that the variable has previously been assigned a value.
ja: どのような代入演算子でも使用できますが、global HitCount += 1のような複合代入では、変数にあらかじめ値が代入されていることが必要です。

source: Any built-in or user-defined class can be used, even if it does not derive from Error.
ja: Errorから派生していなくても、組み込みクラスやユーザー定義クラスであれば使用可能です。

source: Any Ctrl+Z, even one appearing at the very end of the file, is loaded as-is.
ja: Ctrl+Zは、ファイルの末尾に表示されるものでも、そのまま読み込まれます。

source: Any AutoHotkey.exe files found are excluded, leaving files such as AutoHotkeyA32.exe, AutoHotkey64.exe, etc. plus all .bin files found.
ja: 検出されたAutoHotkey.exeファイルは除外され、AutoHotkeyA32.exe、AutoHotkey64.exeなどのファイルと、検出されたすべての.binファイルが残ります。

source: Any active OnError callbacks are called.
ja: アクティブなOnErrorコールバックはすべて呼び出される。

source: Any additional command-line switches that the launcher would insert, such as /CP65001.
ja: ランチャーが挿入するコマンドライン・スイッチなど/CP65001など）。

source: Any address returned by this property becomes invalid when the buffer is freed or reallocated.
ja: このプロパティが返すアドレスは、バッファが解放または再割り当てされたときに無効となる。

source: Any advice?
ja: 何かアドバイスはありますか？

source: Any area that is not part of an item is excluded from the window region.
ja: アイテムの一部でない領域は、ウィンドウ領域から除外される。

source: Any attempt otherwise to copy, modify, sublicense or distribute the Program is void, and will automatically terminate your rights under this License.
ja: それ以外の方法で『プログラム』を複製、変更、サブライセンス、または頒布しようとする試みは無効であり、本使用許諾に基づくあなたの権利は自動的に消滅します。

source: Any backspacing you do is taken into account for the purpose of detecting hotstrings.
ja: ホットストリングスを検出する目的で、あなたが行ったバックスペースは考慮されます。

source: Any binary zero stored in a variable by a function may act as a terminator, preventing all data to the right of the zero from being accessed or changed by most built-in functions.
ja: 関数によって変数に格納された2進数のゼロは、ターミネーターとして機能し、ほとんどの組み込み関数によってゼロの右側のすべてのデータがアクセスまたは変更されるのを防ぐことができます。

source: Any case where the file cannot be written to the destination is considered failure.
ja: 宛先にファイルを書き込めない場合は、すべて失敗とみなします。

source: Any class may contain a property definition and a method definition with the same name.
ja: どのクラスも、同じ名前のプロパティ定義とメソッド定義を含むことができる。

source: Any column at or on the right side of ColumnNumber are shifted to the right to make room for the new column.
ja: ColumnNumberの右側にある列は、新しい列のために右側にシフトされます。

source: Any combination of r, w and d may be used.
ja: r、w、dの組み合わせは自由です。

source: Any disabled window is skipped, unless one of its owned windows was active more recently than it.
ja: 無効化されたウィンドウは、その所有するウィンドウがそれよりも最近アクティブであった場合を除き、スキップされます。

source: Any existing file will be overwritten by the new file.
ja: 既存のファイルは、新しいファイルによって上書きされます。

source: Any explicitly defined parameters come after those.
ja: 明示的に定義されたパラメータはその後に来る。

source: Any extension supplied will be replaced by .exe.
ja: 提供された拡張子はすべて.exeに置き換えられます。

source: Any fractional part of Value is dropped, equivalent to Value < 0 ? Ceil(Value) : Floor(Value).
ja: Valueの端数部分はすべて取り除かれ、Value < 0 ? Ceil(Value) : Floor(Value)と同じになる。

source: Any functions registered by OnExit are called before the script terminates.
ja: OnExit関数によって登録された関数は、スクリプトが終了する前に呼び出されます。

source: Any functions which are called on the auto-execute thread may also affect the default settings.
ja: 自動実行スレッドで呼び出される関数も、デフォルト設定に影響を与える可能性がある。
